<?php

declare(strict_types=1);

namespace app\services\parsers\FIAS\mappers;

class OperationTypesFiasMapper extends AbstractFiasMapper
{

    protected array $map = [
        'ID' => 'id', // Text, 2 chars length
        'NAME' => 'name',
        'SHORTNAME' => 'short_name',
        'DESC' => 'desc',
        'STARTDATE' => 'start_date',
        'ENDDATE' => 'end_date',
        'UPDATEDATE' => 'update_date',
        'ISACTIVE' => 'is_active',
    ];
}
/**
 * ID Принимает значения:
01 – инициация   |
10 – добавление   |
20 – изменение   |
21 – групповое изменение   |
30 – удаление   |
31 – удаление вследствие удаления вышестоящего объекта   |
40 – присоединение адресного объекта (слияние)   |
41 – переподчинение вследствие слияния вышестоящего объекта   |
42 – прекращение существования вследствие присоединения к другому адресному объекту   |
43 – создание нового адресного объекта в результате слияния адресных объектов   |
50 – переподчинение   |
51 – переподчинение вследствие переподчинения вышестоящего объекта   |
60 – прекращение существования вследствие дробления   |
61 – создание нового адресного объекта в результате дробления   |
70 – восстановление прекратившего существование объекта
 */